'''

**

Есть список чисел: 
some_list = [111, 222, 333, 444, 555, 666, 777, 888, 999]. 

* Нужно преобразовать его в одну строку, где элементы списка 
    разделены '---'
    Результат:  
    111---222---333---444---555---666---777---888---999

** дополнительно каждый элемент списка разделить дефисом 
    образец: 111 -> 1-1-1 

    Результат:  
    1-1-1---2-2-2---3-3-3---4-4-4---5-5-5---6-6-6---7-7-7---8-8-8---9-9-9


не использовать for и lambda

'''

l =  [111, 222, 333, 444, 555, 666, 777, 888, 999]

print(f"original: {l}")

ls1 = list(map(str, l))

print(f"variant 1: {"---".join(ls1)}")

ls2 = list(map("-".join, ls1))

print(f"variant 2: {"---".join(ls2)}")
