'''
**Дана матрица:
    matrix = [
        [1, 2, 3],
        [4, 5, 6], 
        [7, 8, 9]
    ]

1 -  Повернуть на 90° по часовой стрелке
    [[7, 4, 1],
     [8, 5, 2],
     [9, 6, 3]]
2 -  Повернуть на 90° против часовой стрелке
    [[3, 6, 9],
     [2, 5, 8],
     [1, 4, 7]]

решить без for и без дополнительных библиотек
программа должна работать с матрицами любых размеров

'''
matrix = [
         [1, 2, 3],
         [4, 5, 6], 
         [7, 8, 9]
         ]

print("original", *matrix, sep="\n")

print("zip", *list(zip(*matrix)), sep="\n")

print("+90", *list(map(list, zip(*reversed(matrix)))), sep="\n")
print("-90", *list(map(list, reversed(list(zip(*matrix))))), sep="\n")
